In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
import sqlite3

%matplotlib inline

In [2]:
df_movies = pd.read_csv('data/tmdb.movies.csv',
                 index_col=0,       
                 encoding='ISO-8859-1',
                 low_memory=False,
                 dtype=str)  
df_movies.head()

,genre_ids,id,original_language,original_title,popularity,release_date,title,vote_average,vote_count
0,"[12, 14, 10751]",12444,en,Harry Potter and the Deathly Hallows: Part 1,33.533,2010-11-19,Harry Potter and the Deathly Hallows: Part 1,7.7,10788
1,"[14, 12, 16, 10751]",10191,en,How to Train Your Dragon,28.734,2010-03-26,How to Train Your Dragon,7.7,7610
2,"[12, 28, 878]",10138,en,Iron Man 2,28.515,2010-05-07,Iron Man 2,6.8,12368
3,"[16, 35, 10751]",862,en,Toy Story,28.005,1995-11-22,Toy Story,7.9,10174
4,"[28, 878, 12]",27205,en,Inception,27.92,2010-07-16,Inception,8.3,22186

In [3]:
df_movies.info()
df_movies.columns = df_movies.columns.str.strip()
df_movies.isna().sum()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 26517 entries, 0 to 26516
Data columns (total 9 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   genre_ids          26517 non-null  object
 1   id                 26517 non-null  object
 2   original_language  26517 non-null  object
 3   original_title     26517 non-null  object
 4   popularity         26517 non-null  object
 5   release_date       26517 non-null  object
 6   title              26517 non-null  object
 7   vote_average       26517 non-null  object
 8   vote_count         26517 non-null  object
dtypes: object(9)
memory usage: 2.0+ MB

genre_ids            0
id                   0
original_language    0
original_title       0
popularity           0
release_date         0
title                0
vote_average         0
vote_count           0
dtype: int64

In [4]:
df_budget = pd.read_csv('data/tn.movie_budgets.csv',
                 index_col=0,
                 encoding='ISO-8859-1',
                 low_memory=False,
                 dtype=str)  
df_budget.head()

,release_date,movie,production_budget,domestic_gross,worldwide_gross
id,,,,,
1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963"
5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747"

In [5]:
df_budget.info()
df_budget.columns = df_budget.columns.str.strip()
df_budget.isna().sum()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 5782 entries, 1 to 82
Data columns (total 5 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   release_date       5782 non-null   object
 1   movie              5782 non-null   object
 2   production_budget  5782 non-null   object
 3   domestic_gross     5782 non-null   object
 4   worldwide_gross    5782 non-null   object
dtypes: object(5)
memory usage: 271.0+ KB

release_date         0
movie                0
production_budget    0
domestic_gross       0
worldwide_gross      0
dtype: int64

In [6]:
df_gross = pd.read_csv('data/bom.movie_gross.csv',
                 index_col=0,
                 encoding='ISO-8859-1',
                 low_memory=False,
                 dtype=str)  
df_gross.head()

,studio,domestic_gross,foreign_gross,year
title,,,,
Toy Story 3,BV,415000000.0,652000000,2010
Alice in Wonderland (2010),BV,334200000.0,691300000,2010
Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010
Inception,WB,292600000.0,535700000,2010
Shrek Forever After,P/DW,238700000.0,513900000,2010

In [7]:
df_gross.info()
df_gross.columns = df_gross.columns.str.strip()
df_gross.isna().sum()

<class 'pandas.core.frame.DataFrame'>
Index: 3387 entries, Toy Story 3 to An Actor Prepares
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   studio          3382 non-null   object
 1   domestic_gross  3359 non-null   object
 2   foreign_gross   2037 non-null   object
 3   year            3387 non-null   object
dtypes: object(4)
memory usage: 132.3+ KB

studio               5
domestic_gross      28
foreign_gross     1350
year                 0
dtype: int64

In [8]:
df_rt = pd.read_csv('data/rt.movie_info.tsv',
                  index_col=0,
                  delimiter='\t',
                  encoding='ISO-8859-1',
                  low_memory=False,
                  dtype=str,
                  error_bad_lines=False)  
df_rt.head()

,synopsis,rating,genre,director,writer,theater_date,dvd_date,currency,box_office,runtime,studio
id,,,,,,,,,,,
1,"This gritty, fast-paced, and innovative police...",R,Action and Adventure|Classics|Drama,William Friedkin,Ernest Tidyman,"Oct 9, 1971","Sep 25, 2001",NaN,NaN,104 minutes,NaN
3,"New York City, not-too-distant-future: Eric Pa...",R,Drama|Science Fiction and Fantasy,David Cronenberg,David Cronenberg|Don DeLillo,"Aug 17, 2012","Jan 1, 2013",$,"600,000",108 minutes,Entertainment One
5,Illeana Douglas delivers a superb performance ...,R,Drama|Musical and Performing Arts,Allison Anders,Allison Anders,"Sep 13, 1996","Apr 18, 2000",NaN,NaN,116 minutes,NaN
6,Michael Douglas runs afoul of a treacherous su...,R,Drama|Mystery and Suspense,Barry Levinson,Paul Attanasio|Michael Crichton,"Dec 9, 1994","Aug 27, 1997",NaN,NaN,128 minutes,NaN
7,NaN,NR,Drama|Romance,Rodney Bennett,Giles Cooper,NaN,NaN,NaN,NaN,200 minutes,NaN

In [9]:
df_rt.info()
df_rt.columns = df_rt.columns.str.strip()
df_rt.isna().sum()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1560 entries, 1 to 2000
Data columns (total 11 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   synopsis      1498 non-null   object
 1   rating        1557 non-null   object
 2   genre         1552 non-null   object
 3   director      1361 non-null   object
 4   writer        1111 non-null   object
 5   theater_date  1201 non-null   object
 6   dvd_date      1201 non-null   object
 7   currency      340 non-null    object
 8   box_office    340 non-null    object
 9   runtime       1530 non-null   object
 10  studio        494 non-null    object
dtypes: object(11)
memory usage: 146.2+ KB

synopsis          62
rating             3
genre              8
director         199
writer           449
theater_date     359
dvd_date         359
currency        1220
box_office      1220
runtime           30
studio          1066
dtype: int64

In [10]:
df_reviews = pd.read_csv('data/rt.reviews.tsv',
                  index_col=0,
                  delimiter='\t',
                  encoding='ISO-8859-1',
                  low_memory=False,
                  dtype=str,
                  error_bad_lines=False)  
df_reviews.head()

,review,rating,fresh,critic,top_critic,publisher,date
id,,,,,,,
3,A distinctly gallows take on contemporary fina...,3/5,fresh,PJ Nabarro,0,Patrick Nabarro,"November 10, 2018"
3,It's an allegory in search of a meaning that n...,NaN,rotten,Annalee Newitz,0,io9.com,"May 23, 2018"
3,... life lived in a bubble in financial dealin...,NaN,fresh,Sean Axmaker,0,Stream on Demand,"January 4, 2018"
3,Continuing along a line introduced in last yea...,NaN,fresh,Daniel Kasman,0,MUBI,"November 16, 2017"
3,... a perverse twist on neorealism...,NaN,fresh,NaN,0,Cinema Scope,"October 12, 2017"

In [11]:
df_reviews.info()
df_reviews.columns = df_reviews.columns.str.strip()
df_reviews.isna().sum()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 54432 entries, 3 to 2000
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   review      48869 non-null  object
 1   rating      40915 non-null  object
 2   fresh       54432 non-null  object
 3   critic      51710 non-null  object
 4   top_critic  54432 non-null  object
 5   publisher   54123 non-null  object
 6   date        54432 non-null  object
dtypes: object(7)
memory usage: 3.3+ MB

review         5563
rating        13517
fresh             0
critic         2722
top_critic        0
publisher       309
date              0
dtype: int64

In [12]:
df_budget['domestic_gross']

id
1     $760,507,625
2     $241,063,875
3      $42,762,350
4     $459,005,868
5     $620,181,382
          ...
78              $0
79         $48,482
80          $1,338
81              $0
82        $181,041
Name: domestic_gross, Length: 5782, dtype: object

In [13]:
# Removing extra characters in domestic_gross to convert to numerice type
# Remove the first character from the values in the 'domestic_gross' column
for col in df_budget.columns:
    # Check if the column contains dollar signs
    if df_budget['domestic_gross'].dtype == 'object' and '$' in df_budget['domestic_gross'].iloc[0]:
        # Replace the dollar signs with an empty string
        df_budget['domestic_gross'] = df_budget['domestic_gross'].str.replace('$', '')

# Remove commas and modify the original DataFrame in place
df_budget['domestic_gross'].replace(',','', regex=True, inplace=True)

# Check the first few rows to verify the change
print(df_budget['domestic_gross'].head())

id
1    760507625
2    241063875
3     42762350
4    459005868
5    620181382
Name: domestic_gross, dtype: object

In [14]:
df_budget['domestic_gross'] = pd.to_numeric(df_budget['domestic_gross'], errors='coerce')

In [15]:
df_budget['domestic_gross']

id
1     760507625
2     241063875
3      42762350
4     459005868
5     620181382
        ...
78            0
79        48482
80         1338
81            0
82       181041
Name: domestic_gross, Length: 5782, dtype: int64

In [16]:
# Removing extra characters in worldwide_gross to convert to numerice type
# Remove the first character from the values in the 'worldwide_gross' column
for col in df_budget.columns:
    # Check if the column contains dollar signs
    if df_budget['worldwide_gross'].dtype == 'object' and '$' in df_budget['worldwide_gross'].iloc[0]:
        # Replace the dollar signs with an empty string
        df_budget['worldwide_gross'] = df_budget['worldwide_gross'].str.replace('$', '')

# Remove commas and modify the original DataFrame in place
df_budget['worldwide_gross'].replace(',','', regex=True, inplace=True)

# Check the first few rows to verify the change
print(df_budget['worldwide_gross'].head())

id
1    2776345279
2    1045663875
3     149762350
4    1403013963
5    1316721747
Name: worldwide_gross, dtype: object

In [17]:
df_budget['worldwide_gross'] = pd.to_numeric(df_budget['worldwide_gross'], errors='coerce')

In [18]:
# Removing extra characters in production_budget to convert to numerice type
# Remove the first character from the values in the 'production_budget' column
for col in df_budget.columns:
    # Check if the column contains dollar signs
    if df_budget['production_budget'].dtype == 'object' and '$' in df_budget['production_budget'].iloc[0]:
        # Replace the dollar signs with an empty string
        df_budget['production_budget'] = df_budget['production_budget'].str.replace('$', '')

# Remove commas and modify the original DataFrame in place
df_budget['production_budget'].replace(',','', regex=True, inplace=True)

# Check the first few rows to verify the change
print(df_budget['production_budget'].head())

id
1    425000000
2    410600000
3    350000000
4    330600000
5    317000000
Name: production_budget, dtype: object

In [19]:
df_budget['production_budget'] = pd.to_numeric(df_budget['production_budget'], errors='coerce')

In [20]:
# Convert the 'release_date' column to datetime
df_budget['release_date'] = pd.to_datetime(df_budget['release_date'])

# Extract the month and create a new 'release_month' column
df_budget['release_month'] = df_budget['release_date'].dt.month

# Add the domestic and worldwide gross to create new column, total_gross
df_budget['total_gross'] = df_budget['domestic_gross'] + df_budget['worldwide_gross']

# Calculate profit
df_budget['total_profit'] = df_budget['total_gross'] - df_budget['production_budget']

# Uset the new column to calculate ROI-create a new column as well
df_budget['ROI'] = (df_budget['total_profit'] - df_budget['production_budget']) / df_budget['production_budget']

# Display the DataFrame with the new 'release_month' column
df_budget.head()

,release_date,movie,production_budget,domestic_gross,worldwide_gross,release_month,total_gross,total_profit,ROI
id,,,,,,,,,
1,2009-12-18,Avatar,425000000,760507625,2776345279,12,3536852904,3111852904,6.322007
2,2011-05-20,Pirates of the Caribbean: On Stranger Tides,410600000,241063875,1045663875,5,1286727750,876127750,1.133774
3,2019-06-07,Dark Phoenix,350000000,42762350,149762350,6,192524700,-157475300,-1.449929
4,2015-05-01,Avengers: Age of Ultron,330600000,459005868,1403013963,5,1862019831,1531419831,3.632244
5,2017-12-15,Star Wars Ep. VIII: The Last Jedi,317000000,620181382,1316721747,12,1936903129,1619903129,4.110105

In [21]:
print(len(df_budget))

5782

In [22]:
# Connect to the SQLite database
conn = sqlite3.connect('Data/im.db')
#"C:\Users\byrdw\Flatiron\Phase-2-Project\Data\im.db"
print(conn)

<sqlite3.Connection object at 0x0000024EA6C5EB70>

In [23]:
#Turn database into DataFrame to visualize tables
df_imdb = pd.read_sql("""SELECT name FROM sqlite_master WHERE type = 'table';""", conn)
df_imdb

            name
0   movie_basics
1      directors
2      known_for
3     movie_akas
4  movie_ratings
5        persons
6     principals
7        writers

In [24]:
# inspecting directors
table_name = 'directors'
query_d = "SELECT * FROM " + table_name
df_directors = pd.read_sql_query(query_d, conn)

print(df_directors.head())

    movie_id  person_id
0  tt0285252  nm0899854
1  tt0462036  nm1940585
2  tt0835418  nm0151540
3  tt0835418  nm0151540
4  tt0878654  nm0089502

In [25]:
# Inspecting movie_ratings
table_name = 'movie_ratings'
query_r = "SELECT * FROM " + table_name
df_ratings = pd.read_sql_query(query_r, conn)

print(df_ratings.head())

     movie_id  averagerating  numvotes
0  tt10356526            8.3        31
1  tt10384606            8.9       559
2   tt1042974            6.4        20
3   tt1043726            4.2     50352
4   tt1060240            6.5        21

In [26]:
# Inspecting principals
table_name = 'principals'
query_p = "SELECT * FROM " + table_name
df_principals = pd.read_sql_query(query_p, conn)

print(df_principals.head())

    movie_id  ordering  person_id  category       job        characters
0  tt0111414         1  nm0246005     actor      None       ["The Man"]
1  tt0111414         2  nm0398271  director      None              None
2  tt0111414         3  nm3739909  producer  producer              None
3  tt0323808        10  nm0059247    editor      None              None
4  tt0323808         1  nm3579312   actress      None  ["Beth Boothby"]

In [27]:
# Inpsecting persons
table_name = 'persons'
query_p = "SELECT * FROM " + table_name
df_persons = pd.read_sql_query(query_p, conn)

print(df_persons.head())

   person_id       primary_name  birth_year  death_year  \
0  nm0061671  Mary Ellen Bauder         NaN         NaN
1  nm0061865       Joseph Bauer         NaN         NaN
2  nm0062070         Bruce Baum         NaN         NaN
3  nm0062195       Axel Baumann         NaN         NaN
4  nm0062798        Pete Baxter         NaN         NaN

                                 primary_profession
0         miscellaneous,production_manager,producer
1        composer,music_department,sound_department
2                        miscellaneous,actor,writer
3  camera_department,cinematographer,art_department
4  production_designer,art_department,set_decorator

In [28]:
# Inspecting movie_basics
table_name = 'movie_basics'
query_mb = "SELECT * FROM " + table_name
df_mbasics = pd.read_sql_query(query_mb, conn)

print(df_mbasics.head())

    movie_id                    primary_title              original_title  \
0  tt0063540                        Sunghursh                   Sunghursh
1  tt0066787  One Day Before the Rainy Season             Ashad Ka Ek Din
2  tt0069049       The Other Side of the Wind  The Other Side of the Wind
3  tt0069204                  Sabse Bada Sukh             Sabse Bada Sukh
4  tt0100275         The Wandering Soap Opera       La Telenovela Errante

   start_year  runtime_minutes                genres
0        2013            175.0    Action,Crime,Drama
1        2019            114.0       Biography,Drama
2        2018            122.0                 Drama
3        2018              NaN          Comedy,Drama
4        2017             80.0  Comedy,Drama,Fantasy

In [29]:
# Construct the SQL query to fetch the desired data from all tables
# Joining the tables to create a new df that has all relevant info
query_combined = """
SELECT 
    movie_basics.primary_title AS movie, 
    persons.primary_name AS director_name, 
    movie_basics.runtime_minutes,
    movie_basics.genres,
    movie_ratings.averagerating
FROM directors
LEFT JOIN movie_basics ON directors.movie_id = movie_basics.movie_id
LEFT JOIN persons ON directors.person_id = persons.person_id
LEFT JOIN movie_ratings ON directors.movie_id = movie_ratings.movie_id
"""

# Execute the query and load the data into a new DataFrame
df_combined = pd.read_sql_query(query_combined, conn)

# Display the first few rows of the combined DataFrame
print("\nCombined DataFrame:")
print(df_combined.head())
print(len(df_combined))

Combined DataFrame:
                             movie      director_name  runtime_minutes  \
0                   Life's a Beach        Tony Vitale            100.0
1  Steve Phoenix: The Untold Story         Bill Haley            110.0
2                   The Babymakers  Jay Chandrasekhar             95.0
3                   The Babymakers  Jay Chandrasekhar             95.0
4                       Bulletface        Albert Pyun             82.0

     genres  averagerating
0    Comedy            3.9
1     Drama            5.5
2    Comedy            5.0
3    Comedy            5.0
4  Thriller            5.8
291174

In [30]:
# Merge df_combined and df_budget on the 'movie_title' column
merged_df = pd.merge(df_combined, df_budget, on='movie', how='inner')

# Display the first few rows of the merged DataFrame
print(merged_df)

              movie    director_name  runtime_minutes                  genres  \
0        Straw Dogs        Rod Lurie            110.0   Action,Drama,Thriller
1        Straw Dogs        Rod Lurie            110.0   Action,Drama,Thriller
2        Straw Dogs        Rod Lurie            110.0   Action,Drama,Thriller
3        Straw Dogs        Rod Lurie            110.0   Action,Drama,Thriller
4        Love Ranch  Taylor Hackford            117.0  Biography,Comedy,Drama
...             ...              ...              ...                     ...
8977  What Men Want    Adam Shankman            117.0  Comedy,Fantasy,Romance
8978  What Men Want    Adam Shankman            117.0  Comedy,Fantasy,Romance
8979  What Men Want    Adam Shankman            117.0  Comedy,Fantasy,Romance
8980  What Men Want    Adam Shankman            117.0  Comedy,Fantasy,Romance
8981  What Men Want    Adam Shankman            117.0  Comedy,Fantasy,Romance

      averagerating release_date  production_budget  domestic_gross  \
0               5.8   2011-09-16           25000000        10324441
1               5.8   2011-09-16           25000000        10324441
2               5.8   2011-09-16           25000000        10324441
3               5.8   2011-09-16           25000000        10324441
4               5.6   2010-06-30           25000000          137885
...             ...          ...                ...             ...
8977            4.9   2019-02-08           20000000        54611903
8978            4.9   2019-02-08           20000000        54611903
8979            4.9   2019-02-08           20000000        54611903
8980            4.9   2019-02-08           20000000        54611903
8981            4.9   2019-02-08           20000000        54611903

      worldwide_gross  release_month  total_gross  total_profit       ROI
0            11253821              9     21578262      -3421738 -1.136870
1            11253821              9     21578262      -3421738 -1.136870
2            11253821              9     21578262      -3421738 -1.136870
3            11253821              9     21578262      -3421738 -1.136870
4              146149              6       284034     -24715966 -1.988639
...               ...            ...          ...           ...       ...
8977         69911903              2    124523806     104523806  4.226190
8978         69911903              2    124523806     104523806  4.226190
8979         69911903              2    124523806     104523806  4.226190
8980         69911903              2    124523806     104523806  4.226190
8981         69911903              2    124523806     104523806  4.226190

[8982 rows x 13 columns]

In [31]:
# Check for duplicates in the 'movie' column
duplicates = merged_df[merged_df.duplicated(subset='movie', keep=False)]

# Count the total number of duplicates
total_duplicates = len(duplicates)

# Display the total number of duplicates
# Check for duplicates in the 'movie' column
duplicates = merged_df[merged_df.duplicated(subset='movie', keep=False)]

# Count the total number of duplicates
total_duplicates = len(duplicates)

# Display the total number of duplicates
print("Total duplicates:", total_duplicates)

print(len(merged_df))

Total duplicates: 8376
8982

In [32]:
merged_df.drop_duplicates(keep=False, inplace=True)
merged_df

,movie,director_name,runtime_minutes,genres,averagerating,release_date,production_budget,domestic_gross,worldwide_gross,release_month,total_gross,total_profit,ROI
4,Love Ranch,Taylor Hackford,117.0,"Biography,Comedy,Drama",5.6,2010-06-30,25000000,137885,146149,6,284034,-24715966,-1.988639
5,Morning Glory,Roger Michell,107.0,"Comedy,Drama,Romance",6.5,2010-11-10,40000000,31011732,59795070,11,90806802,50806802,0.270170
8,The Joneses,Moby Longinotto,80.0,"Biography,Documentary",5.9,2010-04-16,10000000,1475746,3541565,4,5017311,-4982689,-1.498269
18,Coriolanus,Tim Van Someren,192.0,"Drama,History,War",8.7,2012-01-20,10000000,749641,2179623,1,2929264,-7070736,-1.707074
19,Coriolanus,Barry Avrich,NaN,Drama,NaN,2012-01-20,10000000,749641,2179623,1,2929264,-7070736,-1.707074
...,...,...,...,...,...,...,...,...,...,...,...,...,...
8936,Why Did I Get Married Too?,Tyler Perry,121.0,"Comedy,Drama,Romance",4.6,2010-04-02,20000000,60095852,60831067,4,120926919,100926919,4.046346
8941,The Christmas Bunny,Tom Seidman,98.0,"Drama,Family",6.1,2010-12-31,250000,0,0,12,0,-250000,-2.000000
8945,Take Shelter,Jeff Nichols,121.0,"Drama,Horror,Thriller",7.4,2011-09-30,4750000,1728953,4972016,9,6700969,1950969,-0.589270
8946,The Guilt Trip,Anne Fletcher,95.0,"Comedy,Drama",5.8,2012-12-19,40000000,37134215,41294674,12,78428889,38428889,-0.039278
8968,Counting,Jem Cohen,111.0,Documentary,6.0,2015-07-31,50000,8374,8374,7,16748,-33252,-1.665040

In [33]:
final_df = pd.merge(merged_df, df_budget, on='movie', how='inner').fillna(0)
final_df

,movie,director_name,runtime_minutes,genres,averagerating,release_date_x,production_budget_x,domestic_gross_x,worldwide_gross_x,release_month_x,...,total_profit_x,ROI_x,release_date_y,production_budget_y,domestic_gross_y,worldwide_gross_y,release_month_y,total_gross_y,total_profit_y,ROI_y
0,Love Ranch,Taylor Hackford,117.0,"Biography,Comedy,Drama",5.6,2010-06-30,25000000,137885,146149,6,...,-24715966,-1.988639,2010-06-30,25000000,137885,146149,6,284034,-24715966,-1.988639
1,Morning Glory,Roger Michell,107.0,"Comedy,Drama,Romance",6.5,2010-11-10,40000000,31011732,59795070,11,...,50806802,0.270170,2010-11-10,40000000,31011732,59795070,11,90806802,50806802,0.270170
2,The Joneses,Moby Longinotto,80.0,"Biography,Documentary",5.9,2010-04-16,10000000,1475746,3541565,4,...,-4982689,-1.498269,2010-04-16,10000000,1475746,3541565,4,5017311,-4982689,-1.498269
3,Coriolanus,Tim Van Someren,192.0,"Drama,History,War",8.7,2012-01-20,10000000,749641,2179623,1,...,-7070736,-1.707074,2012-01-20,10000000,749641,2179623,1,2929264,-7070736,-1.707074
4,Coriolanus,Barry Avrich,0.0,Drama,0.0,2012-01-20,10000000,749641,2179623,1,...,-7070736,-1.707074,2012-01-20,10000000,749641,2179623,1,2929264,-7070736,-1.707074
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2321,Why Did I Get Married Too?,Tyler Perry,121.0,"Comedy,Drama,Romance",4.6,2010-04-02,20000000,60095852,60831067,4,...,100926919,4.046346,2010-04-02,20000000,60095852,60831067,4,120926919,100926919,4.046346
2322,The Christmas Bunny,Tom Seidman,98.0,"Drama,Family",6.1,2010-12-31,250000,0,0,12,...,-250000,-2.000000,2010-12-31,250000,0,0,12,0,-250000,-2.000000
2323,Take Shelter,Jeff Nichols,121.0,"Drama,Horror,Thriller",7.4,2011-09-30,4750000,1728953,4972016,9,...,1950969,-0.589270,2011-09-30,4750000,1728953,4972016,9,6700969,1950969,-0.589270
2324,The Guilt Trip,Anne Fletcher,95.0,"Comedy,Drama",5.8,2012-12-19,40000000,37134215,41294674,12,...,38428889,-0.039278,2012-12-19,40000000,37134215,41294674,12,78428889,38428889,-0.039278
2325,Counting,Jem Cohen,111.0,Documentary,6.0,2015-07-31,50000,8374,8374,7,...,-33252,-1.665040,2015-07-31,50000,8374,8374,7,16748,-33252,-1.665040

In [34]:
final_df.loc[final_df['release_date_x'] == final_df['release_date_y'], 'release_date_y'] = None

print(final_df)

                           movie    director_name  runtime_minutes  \
0                     Love Ranch  Taylor Hackford            117.0
1                  Morning Glory    Roger Michell            107.0
2                    The Joneses  Moby Longinotto             80.0
3                     Coriolanus  Tim Van Someren            192.0
4                     Coriolanus     Barry Avrich              0.0
...                          ...              ...              ...
2321  Why Did I Get Married Too?      Tyler Perry            121.0
2322         The Christmas Bunny      Tom Seidman             98.0
2323                Take Shelter     Jeff Nichols            121.0
2324              The Guilt Trip    Anne Fletcher             95.0
2325                    Counting        Jem Cohen            111.0

                      genres  averagerating release_date_x  \
0     Biography,Comedy,Drama            5.6     2010-06-30
1       Comedy,Drama,Romance            6.5     2010-11-10
2      Biography,Documentary            5.9     2010-04-16
3          Drama,History,War            8.7     2012-01-20
4                      Drama            0.0     2012-01-20
...                      ...            ...            ...
2321    Comedy,Drama,Romance            4.6     2010-04-02
2322            Drama,Family            6.1     2010-12-31
2323   Drama,Horror,Thriller            7.4     2011-09-30
2324            Comedy,Drama            5.8     2012-12-19
2325             Documentary            6.0     2015-07-31

      production_budget_x  domestic_gross_x  worldwide_gross_x  \
0                25000000            137885             146149
1                40000000          31011732           59795070
2                10000000           1475746            3541565
3                10000000            749641            2179623
4                10000000            749641            2179623
...                   ...               ...                ...
2321             20000000          60095852           60831067
2322               250000                 0                  0
2323              4750000           1728953            4972016
2324             40000000          37134215           41294674
2325                50000              8374               8374

      release_month_x  ...  total_profit_x     ROI_x  release_date_y  \
0                   6  ...       -24715966 -1.988639             NaT
1                  11  ...        50806802  0.270170             NaT
2                   4  ...        -4982689 -1.498269             NaT
3                   1  ...        -7070736 -1.707074             NaT
4                   1  ...        -7070736 -1.707074             NaT
...               ...  ...             ...       ...             ...
2321                4  ...       100926919  4.046346             NaT
2322               12  ...         -250000 -2.000000             NaT
2323                9  ...         1950969 -0.589270             NaT
2324               12  ...        38428889 -0.039278             NaT
2325                7  ...          -33252 -1.665040             NaT

     production_budget_y  domestic_gross_y  worldwide_gross_y  \
0               25000000            137885             146149
1               40000000          31011732           59795070
2               10000000           1475746            3541565
3               10000000            749641            2179623
4               10000000            749641            2179623
...                  ...               ...                ...
2321            20000000          60095852           60831067
2322              250000                 0                  0
2323             4750000           1728953            4972016
2324            40000000          37134215           41294674
2325               50000              8374               8374

      release_month_y  total_gross_y  total_profit_y     ROI_y
0                   6         284034       -24715966 -1.988639
1                  11       90806802        50806802  0.270170
2                   4        5017311        -4982689 -1.498269
3                   1        2929264        -7070736 -1.707074
4                   1        2929264        -7070736 -1.707074
...               ...            ...             ...       ...
2321                4      120926919       100926919  4.046346
2322               12              0         -250000 -2.000000
2323                9        6700969         1950969 -0.589270
2324               12       78428889        38428889 -0.039278
2325                7          16748          -33252 -1.665040

[2326 rows x 21 columns]

In [35]:
final_df.loc[final_df['release_date_x'] == final_df['release_date_y'], 'release_date_y'] = None
final_df.loc[final_df['production_budget_x'] == final_df['production_budget_y'], 'production_budget_y'] = None
final_df.loc[final_df['domestic_gross_x'] == final_df['domestic_gross_y'], 'domestic_gross_y'] = None
final_df.loc[final_df['worldwide_gross_x'] == final_df['worldwide_gross_y'], 'worldwide_gross_y'] = None
final_df.loc[final_df['total_profit_x'] == final_df['total_profit_y'], 'total_profit_y'] = None
final_df.loc[final_df['total_gross_x'] == final_df['total_gross_y'], 'total_gross_y'] = None
final_df.loc[final_df['ROI_x'] == final_df['ROI_y'], 'ROI_y'] = None
final_df.loc[final_df['release_month_x'] == final_df['release_month_y'], 'release_month_y'] = None


print(final_df)

                           movie    director_name  runtime_minutes  \
0                     Love Ranch  Taylor Hackford            117.0
1                  Morning Glory    Roger Michell            107.0
2                    The Joneses  Moby Longinotto             80.0
3                     Coriolanus  Tim Van Someren            192.0
4                     Coriolanus     Barry Avrich              0.0
...                          ...              ...              ...
2321  Why Did I Get Married Too?      Tyler Perry            121.0
2322         The Christmas Bunny      Tom Seidman             98.0
2323                Take Shelter     Jeff Nichols            121.0
2324              The Guilt Trip    Anne Fletcher             95.0
2325                    Counting        Jem Cohen            111.0

                      genres  averagerating release_date_x  \
0     Biography,Comedy,Drama            5.6     2010-06-30
1       Comedy,Drama,Romance            6.5     2010-11-10
2      Biography,Documentary            5.9     2010-04-16
3          Drama,History,War            8.7     2012-01-20
4                      Drama            0.0     2012-01-20
...                      ...            ...            ...
2321    Comedy,Drama,Romance            4.6     2010-04-02
2322            Drama,Family            6.1     2010-12-31
2323   Drama,Horror,Thriller            7.4     2011-09-30
2324            Comedy,Drama            5.8     2012-12-19
2325             Documentary            6.0     2015-07-31

      production_budget_x  domestic_gross_x  worldwide_gross_x  \
0                25000000            137885             146149
1                40000000          31011732           59795070
2                10000000           1475746            3541565
3                10000000            749641            2179623
4                10000000            749641            2179623
...                   ...               ...                ...
2321             20000000          60095852           60831067
2322               250000                 0                  0
2323              4750000           1728953            4972016
2324             40000000          37134215           41294674
2325                50000              8374               8374

      release_month_x  ...  total_profit_x     ROI_x  release_date_y  \
0                   6  ...       -24715966 -1.988639             NaT
1                  11  ...        50806802  0.270170             NaT
2                   4  ...        -4982689 -1.498269             NaT
3                   1  ...        -7070736 -1.707074             NaT
4                   1  ...        -7070736 -1.707074             NaT
...               ...  ...             ...       ...             ...
2321                4  ...       100926919  4.046346             NaT
2322               12  ...         -250000 -2.000000             NaT
2323                9  ...         1950969 -0.589270             NaT
2324               12  ...        38428889 -0.039278             NaT
2325                7  ...          -33252 -1.665040             NaT

     production_budget_y  domestic_gross_y  worldwide_gross_y  \
0                    NaN               NaN                NaN
1                    NaN               NaN                NaN
2                    NaN               NaN                NaN
3                    NaN               NaN                NaN
4                    NaN               NaN                NaN
...                  ...               ...                ...
2321                 NaN               NaN                NaN
2322                 NaN               NaN                NaN
2323                 NaN               NaN                NaN
2324                 NaN               NaN                NaN
2325                 NaN               NaN                NaN

      release_month_y  total_gross_y  total_profit_y  ROI_y
0                 NaN            NaN             NaN    NaN
1                 NaN            NaN             NaN    NaN
2                 NaN            NaN             NaN    NaN
3                 NaN            NaN             NaN    NaN
4                 NaN            NaN             NaN    NaN
...               ...            ...             ...    ...
2321              NaN            NaN             NaN    NaN
2322              NaN            NaN             NaN    NaN
2323              NaN            NaN             NaN    NaN
2324              NaN            NaN             NaN    NaN
2325              NaN            NaN             NaN    NaN

[2326 rows x 21 columns]

In [36]:
del final_df['release_date_y']
del final_df['production_budget_y']
del final_df['domestic_gross_y']
del final_df['release_month_y']
del final_df['worldwide_gross_y']
del final_df['total_gross_y']
del final_df['total_profit_y']
del final_df['ROI_y']

In [ ]:
df = df.rename(columns={'release_date_x': 'release_date', 'production_budget_x': 'production_budget', 'domestic_gross_x': 'domestic_gross', 'release_month_x': 'release_month', 'worldwide'})

In [37]:
# Check for duplicates in the 'movie' column
duplicates = final_df[final_df.duplicated(subset='movie', keep=False)]

# Count the total number of duplicates
total_duplicates = len(duplicates)

# Display the total number of duplicates
# Check for duplicates in the 'movie' column
duplicates = final_df[final_df.duplicated(subset='movie', keep=False)]

# Count the total number of duplicates
total_duplicates = len(duplicates)

# Display the total number of duplicates
print("Total duplicates:", total_duplicates)

print(len(final_df))

Total duplicates: 1564
2326

In [38]:
last_df = final_df.drop_duplicates(subset='movie', keep=False)
last_df

,movie,director_name,runtime_minutes,genres,averagerating,release_date_x,production_budget_x,domestic_gross_x,worldwide_gross_x,release_month_x,total_gross_x,total_profit_x,ROI_x
0,Love Ranch,Taylor Hackford,117.0,"Biography,Comedy,Drama",5.6,2010-06-30,25000000,137885,146149,6,284034,-24715966,-1.988639
1,Morning Glory,Roger Michell,107.0,"Comedy,Drama,Romance",6.5,2010-11-10,40000000,31011732,59795070,11,90806802,50806802,0.270170
2,The Joneses,Moby Longinotto,80.0,"Biography,Documentary",5.9,2010-04-16,10000000,1475746,3541565,4,5017311,-4982689,-1.498269
5,Amigo,John Sayles,124.0,"Drama,War",5.9,2011-08-19,1500000,184705,184705,8,369410,-1130590,-1.753727
6,Housefull,Linson Antony,0.0,Family,3.9,2010-04-30,10100000,1183658,18726300,4,19909958,9809958,-0.028717
...,...,...,...,...,...,...,...,...,...,...,...,...,...
2321,Why Did I Get Married Too?,Tyler Perry,121.0,"Comedy,Drama,Romance",4.6,2010-04-02,20000000,60095852,60831067,4,120926919,100926919,4.046346
2322,The Christmas Bunny,Tom Seidman,98.0,"Drama,Family",6.1,2010-12-31,250000,0,0,12,0,-250000,-2.000000
2323,Take Shelter,Jeff Nichols,121.0,"Drama,Horror,Thriller",7.4,2011-09-30,4750000,1728953,4972016,9,6700969,1950969,-0.589270
2324,The Guilt Trip,Anne Fletcher,95.0,"Comedy,Drama",5.8,2012-12-19,40000000,37134215,41294674,12,78428889,38428889,-0.039278
2325,Counting,Jem Cohen,111.0,Documentary,6.0,2015-07-31,50000,8374,8374,7,16748,-33252,-1.665040

In [39]:
# Check for duplicates in the 'movie' column
duplicates = last_df[last_df.duplicated(subset='movie')]

# Count the total number of duplicates
total_duplicates = len(duplicates)

# Display the total number of duplicates
# Check for duplicates in the 'movie' column
duplicates = last_df[last_df.duplicated(subset='movie', keep=False)]

# Count the total number of duplicates
total_duplicates = len(duplicates)

# Display the total number of duplicates
print("Total duplicates:", total_duplicates)

print(len(last_df))

Total duplicates: 0
762